### Mac App Store apps

# safari extensions
mas "Flow"
mas "Vimari"
mas "uBlacklist for Safari"
mas "Hush"

### brew formulae and casks

tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

brew "coreutils"

# essential tools
brew "asdf" # manage all tool versions
brew "autojump" # j to fuzzy jump to any folder you've visited before
brew "fish" # a better shell
brew "gpg" # encryption
brew "gnupg" # ^^^
brew "vim" # terminal text editor with great power
cask "kitty" # terminal app
brew "neovim" # text editor with even more great power
brew "git" # version manager
brew "python@3" # why isn't this already installed?
brew "direnv" # .envrc dynamic envs
brew "tmux" # terminal window manager
brew "wget" # fetch files from the web
brew "qmk/qmk/qmk" # kbd customization

# exploration of new tools
brew "nushell" # an even better shell

# nice to haves
brew "bat" # better cat
brew "lsd" # better ls
brew "fd" # better find
brew "ripgrep" # better grep
brew "dash" # offline docs viewing
brew "dasht" # dash on terminal
cask "protonvpn" # vpn client
brew "fzf" # fuzzy file finder
brew "gh" # github cli
brew "tldr" # man for the simplefolk
brew "screenplaydev/tap/graphite" # manage stacked PRs

### casks
# social
cask "whatsapp"
cask "signal"
cask "telegram"

# gaming
cask "discord"
cask "steam"

# dev
cask "slack"
cask "sublime-merge"
cask "sublime-text"
cask "visual-studio-code"
cask "firefox-developer-edition"
cask "font-sauce-code-pro-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "insomnia" # http requests
cask "lens" # kubernetes ui
cask "postico" # postgres ui
cask "sequel-pro-nightly" # mysql ui


# tools
cask "alfred" # spotlight clone, with clipboard history
cask "logseq" # note-taking for networked thought
cask "1password-cli" # password manager's cli
cask "1password" # password manager
cask "cloudflare-warp" # pseudo-VPN
cask "deluge" # torrents!!!
cask "dropbox" # files on the cloud boiiii
cask "monodraw" # ascii diagrams
cask "plex" # media server. Netflix who?
cask "qmk-toolbox" # ui for qmk


### should probably use nix for these

# cask "vagrant"
# cask "vagrant-vmware-utility"
# cask "vmware-fusion"
# cask "virTualbox"
# brew "elixir"
# brew "node"
# brew "pnpm"

