
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

# commandline mail app
brew "aerc"
brew "calcurse"
brew "coreutils"
# manage all tool versions
brew "asdf"
brew "python@3"
brew "glib"
brew "tcl-tk"
# j to fuzzy jump to any folder you've visited before
brew "autojump"
brew "python@3.9"
# better cat
brew "bat"
brew "cairo"
brew "cask"
brew "cmake"
brew "ctags"
# offline docs viewing
brew "dash"
brew "direnv"
brew "fd"
brew "fish"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnupg"
brew "gobject-introspection"
brew "helix-editor/helix/helix"
brew "htop"
brew "kakoune"
brew "krb5"
brew "libfixposix"
brew "lsd"
brew "luarocks"
brew "lynx"
brew "neovim"
brew "node"
brew "ranger"
brew "rcm"
brew "ripgrep"
brew "subversion"
brew "the_silver_searcher"
brew "thefuck"
# man for the simplefolk
brew "tldr"
brew "tmux"
brew "v8"
brew "vim"
brew "w3m"
brew "wget"
brew "zellij"
brew "cloudflare/cloudflare/cloudflared"
brew "kak-lsp/kak-lsp/kak-lsp"
brew "qmk/qmk/qmk"
# dotfile manager
brew "yadm"
brew "gpg"

# email client
brew "notmuch"
brew "mutt"

cask "1password-cli"
cask "1password"
cask "alfred"
cask "cloudflare-warp"
cask "deluge"
cask "discord"
cask "dropbox"
cask "firefox-developer-edition"
cask "font-sauce-code-pro-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "insomnia"
cask "lens"
cask "monodraw"
cask "ngrok"
cask "notion"
cask "plex"
cask "postico"
cask "postman"
cask "qmk-toolbox"
cask "sequel-pro-nightly"
cask "signal"
cask "slack"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code-insiders"
cask "whatsapp"
cask "xquartz"
cask "protonvpn"
cask "brave-browser"
cask "kitty"
