
tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

brew "calcurse"
brew "coreutils"
# manage all tool versions
brew "asdf"
brew "python@3"
brew "glib"
brew "tcl-tk"
brew "autojump" # j to fuzzy jump to any folder you've visited before
brew "python@3.9"
brew "bat" # better cat
brew "cairo"
brew "cask"
brew "cmake"
brew "ctags"
brew "dash" # offline docs viewing
brew "dasht" # dash on terminal
brew "direnv"
brew "fd"
brew "fish"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "krb5"
brew "libfixposix"
brew "lsd"
brew "luarocks"
brew "neovim"
brew "node"
brew "ranger" # terminal based file manager
brew "ripgrep"
brew "the_silver_searcher"
brew "tldr" # man for the simplefolk
brew "tmux"
brew "vim"

# email client
brew "notmuch"
brew "mutt"
brew "offlineimap"

brew "w3m" # browse the web from the terminal
brew "wget" # fetch files from the web
brew "qmk/qmk/qmk" # kbd customization
brew "yadm" # dotfile manager
brew "gpg" # encryption
brew "offlineimap" # email client
brew "mu" # mail indexer

brew "elixir"
brew "screenplaydev/tap/graphite"

brew "quill"

cask "1password-cli"
cask "1password"
cask "alfred"
cask "cloudflare-warp"
cask "deluge"
cask "discord"
cask "dropbox"
cask "firefox-developer-edition"
cask "font-sauce-code-pro-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "insomnia" # http requests
cask "lens" # kubernetes ui
cask "monodraw" # ascii diagrams
cask "notion"
cask "plex"
cask "postico"
cask "qmk-toolbox" # ui for qmk
cask "sequel-pro-nightly"
cask "signal"
cask "slack"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code-insiders"
cask "whatsapp"
cask "xquartz" # x-window system on macos
cask "protonvpn"
cask "kitty" # terminal app
cask "spotify" # music player
cask "spark"
cask "vagrant"
cask "vagrant-vmware-utility"
cask "vmware-fusion"
cask "virtualbox"
